/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить 
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton 
 *  не несет никакой ответственности за возможные последствия использования данного, или 
 *  разработанного пользователем на его основе, ПО.
*
 *--------------------------------------------------------------------------------------------
 *
 *  Файл gl.h: Вывод графических примитивов на LCD-экран
 *
 *============================================================================================*/

#ifndef __GL_H
#define __GL_H

#include "types.h"

void LCD_PutPixel(u32 x, u32 y);
void LCD_Line(u32 x1, u32 y1, u32 x2, u32 y2);
void LCD_Circle(u32 xc, u32 yc, u32 r);

#endif /* __GL_H */

/*============================================================================================
 * Конец файла gl.h
 *============================================================================================*/

