/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл systick.h: Утилиты нижнего уровня для работы с системным таймером
 *
 *============================================================================================*/

#ifndef __SYSTICK_H
#define __SYSTICK_H

#include "types.h"

/* Управление системным таймером */
void SysTickStart(u32 ticks);
void SysTickStop();

/* Функция задержки (на базе systick) */
void SysTickDelay(u32 val);
/*RTC init*/
void RTC_INIT(void);
#endif /* __SYSTICK_H */

/*============================================================================================
 * Конец файла systick.h
 *============================================================================================*/

