/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл systick.c: Утилиты нижнего уровня для работы с системным таймером
 *
 *============================================================================================*/

#include "systick.h"

/* Счетчик ожидания */
static vu32 TimerCounter = 0;

/* Управление системным таймером */
void SysTickStart(u32 ticks) {
    SYS->STRVR = ticks;
    SYS->STCSR = mask_SYS_STCSR_ENABLE | mask_SYS_STCSR_TICKINT | mask_SYS_STCSR_CLKSOURCE;
}


void SysTickStop() {
    SYS->STCSR &= ~mask_SYS_STCSR_ENABLE;
}



/* Функция задержки (на базе systick) */
void SysTickDelay(u32 ticks) {
    if (ticks) {
        TimerCounter = ticks;
        SysTickStart(ticks);
        while (TimerCounter);
        SysTickStop();
    }
}


/*============================================================================================
 * Конец файла systick.c
 *============================================================================================*/

